# CableTraySizeIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CableTraySizeIterator Properties
CableTraySizeIterator Class See Also
---
The CableTraySizeIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets the item at the current position of the iterator. |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
CableTraySizeIterator Class
Autodesk.Revit.DB.Electrical Namespace